//Треба створити симулятор руху автомобіля. Умови роботи наступні:
//Автомобіль описується класом Car.
//Кожне авто обов’язково має свій власний двигун та актуальну швидкість.
//Початкова швидкість авто завжди 0.
//Швидкість кожного авто може приймати значення від 0 до 180.
//Швидкість має бути відкрита для отримання ззовні.
//Двигун описується класом Engine. Двигуни бувають двох типів — дизельний та внтрішнього згорання
//(класи DieselEngine та OilEngine).
//Кожен двигун має поле, що означає базовий приріст шидкості — BaseSpeed.
//Це значення залежить лише від типу двигуна і не може бути змінено.
//Для дизельного двигуна це значення 10, а для внутрішнього — 15.
//Існує можливість збільшити швидкість авто чи зменшити її.
//Для цього є методи IncreaseSpeed та DecreaseSpeed. Іншого способу змінити швидкість авто немає.
//При збільшенні швидкості до поточної швидкості додається приріст швидкості двигуна,
//що належить цьому авто. У випадку зниження швидкості навпаки — віднімається.
//Якщо отримане значення швидкості виходить за можливий діапазон,
//то треба просто утримувати мінімальне/максимальне значення швидкості.
//P.S.: Насправді, швидкість розраховується набагато складніше, а це лише тестовий приклад,
//що дуже спрощено імітує роботу авто.

namespace Basic_15_bonus_02_car_simulator
{
    internal class Program
    {
        static void Main(string[] args)
        {
            Console.WriteLine("Hello, World!");
            Car carOil = new Car(new OilEngine());
            Car carDiesel = new Car(new DieselEngine());

            for (int i = 0; i < 20; i++)
            {
                carOil.IncreaseSpeed();
                Console.Write(carOil.Speed + "\t");
                carDiesel.IncreaseSpeed();
                Console.WriteLine(carDiesel.Speed);
            }
            Console.WriteLine("---------");

            for (int i = 0; i < 40; i++)
            {
                carOil.DecreaseSpeed();
                Console.Write(carOil.Speed + "\t");
                carDiesel.DecreaseSpeed();
                Console.WriteLine(carDiesel.Speed);
            }
        }
    }
}
